In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    'Name':['Sherry','Hamza','Zulqarnain','Asad'],
    'Marks':[72.58, 75, 72, 60],
    'City':['Karachi','NawabShah','MianWali','Sukkur']
}

In [3]:
df = pd.DataFrame(dict) # That how you make a DataFrame (DataFrame is Multidimensionall)
df

         Name  Marks       City
0      Sherry  72.58    Karachi
1       Hamza  75.00  NawabShah
2  Zulqarnain  72.00   MianWali
3        Asad  60.00     Sukkur

In [4]:
df.to_csv('friends.csv') # If we want to convert DataFrame into a Excel File we can done like this

In [5]:
df.to_csv('friends.csv', index=False)  # if we don't want index in this csv file so before converting we can give 
#him argument index=false

In [6]:
df.head(2)
# This command will show the first 2 row of our DataFrame

     Name  Marks       City
0  Sherry  72.58    Karachi
1   Hamza  75.00  NawabShah

In [7]:
df.tail(2)
# This command will show the last 2 row of our DataFrame

         Name  Marks      City
2  Zulqarnain   72.0  MianWali
3        Asad   60.0    Sukkur

In [8]:
df.describe()
# .describe() The describe() method is used for calculating some statistical data like percentile, mean and std of the numerical 
#values of the Series or DataFrame. It analyzes both numeric and object series and also the DataFrame column sets of mixed 
#data types.

           Marks
count   4.000000
mean   69.895000
std     6.723399
min    60.000000
25%    69.000000
50%    72.290000
75%    73.185000
max    75.000000

In [9]:
Sherry = pd.read_csv('Sherry.csv') 
# If you want to read any csv file you can read with this command

In [10]:
Sherry

   Unnamed: 0   Train  Speed       City
0           0   12341   87.0    Karachi
1           1   12314   75.0  NawabShah
2           2  132416   72.0   MianWali
3           3   12344   60.0     Sukkur

In [11]:
Sherry['Train'] # We can read the specific whole coulmn like this

0     12341
1     12314
2    132416
3     12344
Name: Train, dtype: int64

In [12]:
Sherry['Speed'][2] # We can read the specific value of a column like this

72.0

In [13]:
Sherry['Speed'][0] = 87
# We can change the value like this

<ipython-input-13-6130ba9ca379>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sherry['Speed'][0] = 87

In [14]:
Sherry

   Unnamed: 0   Train  Speed       City
0           0   12341   87.0    Karachi
1           1   12314   75.0  NawabShah
2           2  132416   72.0   MianWali
3           3   12344   60.0     Sukkur

In [15]:
# Now we can save this change into the same file
Sherry.to_csv('Sherry.csv')

In [16]:
Sherry.index=["First",'Second','Third','Fourth']
# We can change index of any dataFrame 
Sherry

        Unnamed: 0   Train  Speed       City
First            0   12341   87.0    Karachi
Second           1   12314   75.0  NawabShah
Third            2  132416   72.0   MianWali
Fourth           3   12344   60.0     Sukkur

In [20]:
newSer = pd.Series(np.random.rand(34)) # Here we create a Series in which there are 34 random numbers from numpy 
# Series is one dimension array

In [22]:
newSer

0     0.346648
1     0.121248
2     0.968638
3     0.321475
4     0.471626
5     0.876218
6     0.971062
7     0.116855
8     0.287806
9     0.279684
10    0.287083
11    0.697947
12    0.881509
13    0.002182
14    0.908909
15    0.457070
16    0.980512
17    0.734482
18    0.479191
19    0.008837
20    0.998091
21    0.709987
22    0.147483
23    0.198933
24    0.097433
25    0.078118
26    0.526272
27    0.583564
28    0.889415
29    0.830161
30    0.633031
31    0.876668
32    0.760550
33    0.409847
dtype: float64

In [24]:
type(newSer) 
# We can see the type of Series or DataFrame from type function

pandas.core.series.Series

In [32]:
newDf = pd.DataFrame(np.random.rand(344, 5), index=np.arange(1,345))

In [33]:
newDf

            0         1         2         3         4
1    0.746449  0.178202  0.958791  0.675825  0.298656
2    0.236215  0.278423  0.162431  0.411089  0.629159
3    0.937585  0.522467  0.421525  0.204230  0.599851
4    0.736189  0.977372  0.198534  0.770376  0.437516
5    0.262930  0.288190  0.161924  0.370136  0.369784
..        ...       ...       ...       ...       ...
340  0.399679  0.630620  0.726396  0.663521  0.851934
341  0.704991  0.722875  0.646316  0.364768  0.100815
342  0.817658  0.979875  0.574798  0.167763  0.950489
343  0.322693  0.898070  0.166951  0.263656  0.790026
344  0.090295  0.167508  0.282684  0.516336  0.835305

[344 rows x 5 columns]

In [35]:
type(newDf)

pandas.core.frame.DataFrame

In [36]:
newDf.describe()

                0           1           2           3           4
count  344.000000  344.000000  344.000000  344.000000  344.000000
mean     0.503285    0.479093    0.489727    0.471572    0.529319
std      0.285356    0.295218    0.304389    0.291533    0.275848
min      0.014430    0.008645    0.000699    0.000245    0.004005
25%      0.259729    0.218187    0.199680    0.207937    0.309485
50%      0.498978    0.470537    0.503983    0.448953    0.549819
75%      0.745710    0.735529    0.768074    0.715756    0.758988
max      0.997649    0.989640    0.999884    0.999769    0.998487

In [38]:
newDf.dtypes  # Type of Column

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newDf[0][1] = "Sherry"

In [42]:
newDf.head()  # Now here we change the first element of first row and column , now the datatype of this column will be change

          0         1         2         3         4
1    Sherry  0.178202  0.958791  0.675825  0.298656
2  0.236215  0.278423  0.162431  0.411089  0.629159
3  0.937585  0.522467  0.421525  0.204230  0.599851
4  0.736189  0.977372  0.198534  0.770376  0.437516
5   0.26293  0.288190  0.161924  0.370136  0.369784

In [43]:
newDf.dtypes
# now you can see the datatype of first column change into object because it has a string value

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [44]:
newDf.index
# That how we can see the indexes of a DataFrame

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            335, 336, 337, 338, 339, 340, 341, 342, 343, 344],
           dtype='int64', length=344)

In [45]:
newDf.columns
# That how we can see the Columns of a DataFrame

RangeIndex(start=0, stop=5, step=1)

In [ ]:
newDf.T 
# This command will transpose the whole DataFrame mean now there will be 344 columns and 5 rows

In [46]:
newDf.sort_index(axis=0, ascending=False)
# axis = 0 == rows , axis =1 == columns (acsending = False == ulta)

             0         1         2         3         4
344  0.0902953  0.167508  0.282684  0.516336  0.835305
343   0.322693  0.898070  0.166951  0.263656  0.790026
342   0.817658  0.979875  0.574798  0.167763  0.950489
341   0.704991  0.722875  0.646316  0.364768  0.100815
340   0.399679  0.630620  0.726396  0.663521  0.851934
..         ...       ...       ...       ...       ...
5      0.26293  0.288190  0.161924  0.370136  0.369784
4     0.736189  0.977372  0.198534  0.770376  0.437516
3     0.937585  0.522467  0.421525  0.204230  0.599851
2     0.236215  0.278423  0.162431  0.411089  0.629159
1       Sherry  0.178202  0.958791  0.675825  0.298656

[344 rows x 5 columns]

In [47]:
newDf.head(2)

          0         1         2         3         4
1    Sherry  0.178202  0.958791  0.675825  0.298656
2  0.236215  0.278423  0.162431  0.411089  0.629159

In [53]:
newDf.loc[1,0] = 74.56 
# loc func will change the value (.loc[row,column])

In [54]:
newDf.head(2)

          0         1         2         3         4
1     74.56  0.178202  0.958791  0.675825  0.298656
2  0.236215  0.278423  0.162431  0.411089  0.629159

In [60]:
newDf = newDf.drop(0,axis=1)
# this will delete the 0 column

In [61]:
newDf

             1         2         3         4
1     0.178202  0.958791  0.675825  0.298656
2     0.278423  0.162431  0.411089  0.629159
3     0.522467  0.421525  0.204230  0.599851
4     0.977372  0.198534  0.770376  0.437516
5     0.288190  0.161924  0.370136  0.369784
..         ...       ...       ...       ...
341   0.722875  0.646316  0.364768  0.100815
342   0.979875  0.574798  0.167763  0.950489
343   0.898070  0.166951  0.263656  0.790026
344   0.167508  0.282684  0.516336  0.835305
0    74.560000       NaN       NaN       NaN

[345 rows x 4 columns]

In [62]:
newDf.columns = ['A','B','C','D'] 
# Changing Column names

In [64]:
newDf.head(2)

          A         B         C         D
1  0.178202  0.958791  0.675825  0.298656
2  0.278423  0.162431  0.411089  0.629159

In [65]:
newDf.loc[[1,2],['C','D']]
# This will show the first 2 (1 & 2 ) rows of Column (C & D)

          C         D
1  0.675825  0.298656
2  0.411089  0.629159

In [66]:
newDf.loc[[1,2],:] 
# With this colon this command will print the 1 & 2 rows of all columns

          A         B         C         D
1  0.178202  0.958791  0.675825  0.298656
2  0.278423  0.162431  0.411089  0.629159

In [67]:
newDf.loc[(newDf['A']>1)]

       A   B   C   D
0  74.56 NaN NaN NaN

In [68]:
newDf.head(3)

          A         B         C         D
1  0.178202  0.958791  0.675825  0.298656
2  0.278423  0.162431  0.411089  0.629159
3  0.522467  0.421525  0.204230  0.599851

In [69]:
newDf.reset_index(drop=True)
# this will reset the index

             A         B         C         D
0     0.178202  0.958791  0.675825  0.298656
1     0.278423  0.162431  0.411089  0.629159
2     0.522467  0.421525  0.204230  0.599851
3     0.977372  0.198534  0.770376  0.437516
4     0.288190  0.161924  0.370136  0.369784
..         ...       ...       ...       ...
340   0.722875  0.646316  0.364768  0.100815
341   0.979875  0.574798  0.167763  0.950489
342   0.898070  0.166951  0.263656  0.790026
343   0.167508  0.282684  0.516336  0.835305
344  74.560000       NaN       NaN       NaN

[345 rows x 4 columns]

In [71]:
newDf.index = np.arange(1,346)

In [72]:
newDf.head(4)

          A         B         C         D
1  0.178202  0.958791  0.675825  0.298656
2  0.278423  0.162431  0.411089  0.629159
3  0.522467  0.421525  0.204230  0.599851
4  0.977372  0.198534  0.770376  0.437516

In [81]:
newDf.loc[[1,6] , ['C']] = None

In [82]:
newDf.head(10)

           A         B         C         D
1   0.178202  0.958791       NaN  0.298656
2   0.278423  0.162431  0.411089  0.629159
3   0.522467  0.421525  0.204230  0.599851
4   0.977372  0.198534  0.770376  0.437516
5   0.288190  0.161924  0.370136  0.369784
6   0.561057  0.629709       NaN  0.720569
7   0.989640  0.573583  0.206927  0.700061
8   0.368494  0.586975  0.293693  0.398215
9   0.209648  0.104573  0.157019  0.417692
10  0.944756  0.543063  0.881488  0.529588

In [84]:
newDf.isnull()

         A      B      C      D
1    False  False   True  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
5    False  False  False  False
..     ...    ...    ...    ...
341  False  False  False  False
342  False  False  False  False
343  False  False  False  False
344  False  False  False  False
345  False   True   True   True

[345 rows x 4 columns]

In [85]:
newDf.head()

          A         B         C         D
1  0.178202  0.958791       NaN  0.298656
2  0.278423  0.162431  0.411089  0.629159
3  0.522467  0.421525  0.204230  0.599851
4  0.977372  0.198534  0.770376  0.437516
5  0.288190  0.161924  0.370136  0.369784

In [87]:
ADF = pd.DataFrame({
    'name':['Sherry','Hamza','Zulqarnain'],
    'Class':[np.nan,11,12],
    'born':['26-2-2004',np.nan,np.nan]
})
ADF

         name  Class       born
0      Sherry    NaN  26-2-2004
1       Hamza   11.0        NaN
2  Zulqarnain   12.0        NaN

In [89]:
ADF.dropna(how='all', axis=1) 
# if there are all values are none in column dropna will remove that column

         name  Class       born
0      Sherry    NaN  26-2-2004
1       Hamza   11.0        NaN
2  Zulqarnain   12.0        NaN

In [90]:
ADF.dropna()
# if there are any of the value in a row is none this will remove the whole row

Empty DataFrame
Columns: [name, Class, born]
Index: []

In [91]:
ADF

         name  Class       born
0      Sherry    NaN  26-2-2004
1       Hamza   11.0        NaN
2  Zulqarnain   12.0        NaN

In [93]:
ADF.shape
# This will print the number of rows and columns of the DataFrame

(3, 3)

In [94]:
ADF.info()
# This will give the info about our DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Class   2 non-null      float64
 2   born    1 non-null      object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [95]:
ADF.notnull()
# This is opposite  of isnull

   name  Class   born
0  True  False   True
1  True   True  False
2  True   True  False

In [96]:
ADF.isnull()

    name  Class   born
0  False   True  False
1  False  False   True
2  False  False   True

# Quiz by Harry Bhai

In [98]:
MyDataF = pd.DataFrame({
    1:[10,100,1000],
    2:[20,200,2000]
}, index=list('ABC'))
MyDataF

      1     2
A    10    20
B   100   200
C  1000  2000

In [99]:
MyDataF.std()

1     547.448628
2    1094.897255
dtype: float64

In [100]:
MyDataF.median()

1    100.0
2    200.0
dtype: float64

In [101]:
MyDataF.mean()

1    370.0
2    740.0
dtype: float64

In [102]:
MyDataF.max()

1    1000
2    2000
dtype: int64

In [103]:
MyDataF.count()

1    3
2    3
dtype: int64

In [104]:
MyDataF.corr()

     1    2
1  1.0  1.0
2  1.0  1.0

In [105]:
MyDataF.min()

1    10
2    20
dtype: int64

In [106]:
MyDataF.describe()

                 1            2
count     3.000000     3.000000
mean    370.000000   740.000000
std     547.448628  1094.897255
min      10.000000    20.000000
25%      55.000000   110.000000
50%     100.000000   200.000000
75%     550.000000  1100.000000
max    1000.000000  2000.000000